Лабораторная работа №3:  Работа с файлами в Python: открытие, чтение, запись, работа с исключениями 

Цель работы: Освоить принципы определения и использования функций в языке программирования Python, понять механизмы передачи аргументов в функции, научиться применять функции для решения практических задач, а также изучить базовые алгоритмические конструкции.

Задание 1:  Открытие и чтение файла

1.	Создайте текстовый файл example.txt и заполните его несколькими строками текста.
Используем конструкцию with open(file_name, “w”) as f чтобы открыть файл и закрыть его после выполнения кода внутри конструкции, открываем файл на запись – write – w (Это в то же время стирает предыдущие записи, т.е. как бы перезаписывает). Пишем as f, чтобы сразу присвоить имя файлу. Используем file.write() чтобы записать в конец. 
2.	Напишите функцию на Python, которая открывает файл example.txt в режиме чтения и выводит его содержимое на экран.
Используем конструкцию with open(file_name, “r”) as f чтобы открыть файл и закрыть его после выполнения кода внутри конструкции, открываем файл на чтение – read – r . Пишем as f, чтобы сразу файл переменной. Используем file.readlines() – возвращает массив из строк файла. Используем join, чтобы соединить строки из массива. 
3.	Используйте разные методы чтения файла: чтение всего файла сразу, построчное чтение, реализуйте выбор типа чтения в принимаемых аргументах функции.
f.readlines() - чтение всех строк в массив строчек. f.read() чтение всего файла стандартным методом read, возвращает str (если указываем аргумент функции – число n, читает первые n строчек). Используем цикл for по строчкам файла: for line in f. Затем - print(f.readline()), чтобы вывести файл построчно. print(*f) – читерский метод вывода содержимого файла экран, как бы распаковка. Выбор типа чтения реализуем условными операторами


Задание 2:  Запись в файл

1.	Напишите программу, которая запрашивает у пользователя текст и записывает его в новый файл user_input.txt.
Используем конструкцию input("введите текст: ") чтобы одновременно высветить команду пользователю и принять его ответ. Используем with open("user_input.txt", 'w', encoding='utf-8') as f во-первых, чтобы не вешать оперативку и закрыть файл сразу после использования (With open), во-вторых, используем кодировку utf-8 чтобы русские буквы не переехали в китай, в-третьих, «w» - чтобы реализовать перезапись в файл. в-четвертых, as f – сразу присваивает файл перемененной f. f.write(text) - стандартная запись в файл (с 1-ой позиции).
2.	Реализуйте функционал добавления текста в существующий файл, не удаляя его предыдущее содержимое. Вместо «w» при открытии используем «a» (типо add). 


Задание 3:  Запись в файл

1.	Модифицируйте программу из Задания 1 так, чтобы она корректно обрабатывала исключение, возникающее при попытке открыть несуществующий файл. Вместо вывода ошибки программа должна выводить пользователю понятное сообщение.

	Используйте в блоке try except следующий класс исключений: FileNotFoundError.






